---
title: SymbolTypeId
classe: Autodesk.Revit.DB.SymbolTypeId
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 371
---

# SymbolTypeId

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ForgeTypeId Acres { get; }` | `SymbolTypeId.Acres` | ForgeTypeId |
| `ForgeTypeId Ampere { get; }` | `SymbolTypeId.Ampere` | ForgeTypeId |
| `ForgeTypeId Atm { get; }` | `SymbolTypeId.Atm` | ForgeTypeId |
| `ForgeTypeId Baht { get; }` | `SymbolTypeId.Baht` | ForgeTypeId |
| `ForgeTypeId Bar { get; }` | `SymbolTypeId.Bar` | ForgeTypeId |
| `ForgeTypeId Btu { get; }` | `SymbolTypeId.Btu` | ForgeTypeId |
| `ForgeTypeId BtuPerDegreeF { get; }` | `SymbolTypeId.BtuPerDegreeF` | ForgeTypeId |
| `ForgeTypeId BtuPerFtSup2DegreeF { get; }` | `SymbolTypeId.BtuPerFtSup2DegreeF` | ForgeTypeId |
| `ForgeTypeId BtuPerH { get; }` | `SymbolTypeId.BtuPerH` | ForgeTypeId |
| `ForgeTypeId BtuPerHFtDegreeF { get; }` | `SymbolTypeId.BtuPerHFtDegreeF` | ForgeTypeId |
| `ForgeTypeId BtuPerHFtSup2 { get; }` | `SymbolTypeId.BtuPerHFtSup2` | ForgeTypeId |
| `ForgeTypeId BtuPerHFtSup2DegreeF { get; }` | `SymbolTypeId.BtuPerHFtSup2DegreeF` | ForgeTypeId |
| `ForgeTypeId BtuPerHFtSup3 { get; }` | `SymbolTypeId.BtuPerHFtSup3` | ForgeTypeId |
| `ForgeTypeId BtuPerLb { get; }` | `SymbolTypeId.BtuPerLb` | ForgeTypeId |
| `ForgeTypeId BtuPerLbDegreeF { get; }` | `SymbolTypeId.BtuPerLbDegreeF` | ForgeTypeId |
| `ForgeTypeId BtuPerS { get; }` | `SymbolTypeId.BtuPerS` | ForgeTypeId |
| `ForgeTypeId Cal { get; }` | `SymbolTypeId.Cal` | ForgeTypeId |
| `ForgeTypeId CalPerS { get; }` | `SymbolTypeId.CalPerS` | ForgeTypeId |
| `ForgeTypeId Cd { get; }` | `SymbolTypeId.Cd` | ForgeTypeId |
| `ForgeTypeId CdPerFtSup2 { get; }` | `SymbolTypeId.CdPerFtSup2` | ForgeTypeId |
| `ForgeTypeId CdPerMSup2 { get; }` | `SymbolTypeId.CdPerMSup2` | ForgeTypeId |
| `ForgeTypeId Cf { get; }` | `SymbolTypeId.Cf` | ForgeTypeId |
| `ForgeTypeId Cfh { get; }` | `SymbolTypeId.Cfh` | ForgeTypeId |
| `ForgeTypeId Cfm { get; }` | `SymbolTypeId.Cfm` | ForgeTypeId |
| `ForgeTypeId CfmPerCf { get; }` | `SymbolTypeId.CfmPerCf` | ForgeTypeId |
| `ForgeTypeId CfmPerFtSup2 { get; }` | `SymbolTypeId.CfmPerFtSup2` | ForgeTypeId |
| `ForgeTypeId CfmPerFtSup3 { get; }` | `SymbolTypeId.CfmPerFtSup3` | ForgeTypeId |
| `ForgeTypeId CfmPerSf { get; }` | `SymbolTypeId.CfmPerSf` | ForgeTypeId |
| `ForgeTypeId CfmPerTon { get; }` | `SymbolTypeId.CfmPerTon` | ForgeTypeId |
| `ForgeTypeId ChineseHongKongDollar { get; }` | `SymbolTypeId.ChineseHongKongDollar` | ForgeTypeId |
| `ForgeTypeId Cm { get; }` | `SymbolTypeId.Cm` | ForgeTypeId |
| `ForgeTypeId CmCaret2 { get; }` | `SymbolTypeId.CmCaret2` | ForgeTypeId |
| `ForgeTypeId CmCaret3 { get; }` | `SymbolTypeId.CmCaret3` | ForgeTypeId |
| `ForgeTypeId Cmh { get; }` | `SymbolTypeId.Cmh` | ForgeTypeId |
| `ForgeTypeId CmPerMin { get; }` | `SymbolTypeId.CmPerMin` | ForgeTypeId |
| `ForgeTypeId Cms { get; }` | `SymbolTypeId.Cms` | ForgeTypeId |
| `ForgeTypeId CmSup2 { get; }` | `SymbolTypeId.CmSup2` | ForgeTypeId |
| `ForgeTypeId CmSup2PerM { get; }` | `SymbolTypeId.CmSup2PerM` | ForgeTypeId |
| `ForgeTypeId CmSup3 { get; }` | `SymbolTypeId.CmSup3` | ForgeTypeId |
| `ForgeTypeId CmSup4 { get; }` | `SymbolTypeId.CmSup4` | ForgeTypeId |
| `ForgeTypeId CmSup6 { get; }` | `SymbolTypeId.CmSup6` | ForgeTypeId |
| `ForgeTypeId Colon1 { get; }` | `SymbolTypeId.Colon1` | ForgeTypeId |
| `ForgeTypeId Colon10 { get; }` | `SymbolTypeId.Colon10` | ForgeTypeId |
| `ForgeTypeId Colon12 { get; }` | `SymbolTypeId.Colon12` | ForgeTypeId |
| `ForgeTypeId CP { get; }` | `SymbolTypeId.CP` | ForgeTypeId |
| `ForgeTypeId Cps { get; }` | `SymbolTypeId.Cps` | ForgeTypeId |
| `ForgeTypeId Custom { get; }` | `SymbolTypeId.Custom` | ForgeTypeId |
| `ForgeTypeId Cy { get; }` | `SymbolTypeId.Cy` | ForgeTypeId |
| `ForgeTypeId DaN { get; }` | `SymbolTypeId.DaN` | ForgeTypeId |
| `ForgeTypeId DaNDashM { get; }` | `SymbolTypeId.DaNDashM` | ForgeTypeId |
| `ForgeTypeId DaNDashMPerM { get; }` | `SymbolTypeId.DaNDashMPerM` | ForgeTypeId |
| `ForgeTypeId DaNPerM { get; }` | `SymbolTypeId.DaNPerM` | ForgeTypeId |
| `ForgeTypeId DaNPerMSup2 { get; }` | `SymbolTypeId.DaNPerMSup2` | ForgeTypeId |
| `ForgeTypeId Degree { get; }` | `SymbolTypeId.Degree` | ForgeTypeId |
| `ForgeTypeId DegreeC { get; }` | `SymbolTypeId.DegreeC` | ForgeTypeId |
| `ForgeTypeId DegreeCInterval { get; }` | `SymbolTypeId.DegreeCInterval` | ForgeTypeId |
| `ForgeTypeId DegreeF { get; }` | `SymbolTypeId.DegreeF` | ForgeTypeId |
| `ForgeTypeId DegreeFInterval { get; }` | `SymbolTypeId.DegreeFInterval` | ForgeTypeId |
| `ForgeTypeId DegreeR { get; }` | `SymbolTypeId.DegreeR` | ForgeTypeId |
| `ForgeTypeId DegreeRInterval { get; }` | `SymbolTypeId.DegreeRInterval` | ForgeTypeId |
| `ForgeTypeId DeltaDegreeC { get; }` | `SymbolTypeId.DeltaDegreeC` | ForgeTypeId |
| `ForgeTypeId DeltaDegreeF { get; }` | `SymbolTypeId.DeltaDegreeF` | ForgeTypeId |
| `ForgeTypeId DeltaDegreeR { get; }` | `SymbolTypeId.DeltaDegreeR` | ForgeTypeId |
| `ForgeTypeId DeltaK { get; }` | `SymbolTypeId.DeltaK` | ForgeTypeId |
| `ForgeTypeId Dm { get; }` | `SymbolTypeId.Dm` | ForgeTypeId |
| `ForgeTypeId DollarHPerBtu { get; }` | `SymbolTypeId.DollarHPerBtu` | ForgeTypeId |
| `ForgeTypeId DollarPerBtu { get; }` | `SymbolTypeId.DollarPerBtu` | ForgeTypeId |
| `ForgeTypeId DollarPerFtSup2 { get; }` | `SymbolTypeId.DollarPerFtSup2` | ForgeTypeId |
| `ForgeTypeId DollarPerMSup2 { get; }` | `SymbolTypeId.DollarPerMSup2` | ForgeTypeId |
| `ForgeTypeId DollarPerW { get; }` | `SymbolTypeId.DollarPerW` | ForgeTypeId |
| `ForgeTypeId DollarPerWH { get; }` | `SymbolTypeId.DollarPerWH` | ForgeTypeId |
| `ForgeTypeId Dong { get; }` | `SymbolTypeId.Dong` | ForgeTypeId |
| `ForgeTypeId EuroPrefix { get; }` | `SymbolTypeId.EuroPrefix` | ForgeTypeId |
| `ForgeTypeId EuroSuffix { get; }` | `SymbolTypeId.EuroSuffix` | ForgeTypeId |
| `ForgeTypeId Fc { get; }` | `SymbolTypeId.Fc` | ForgeTypeId |
| `ForgeTypeId FeetOfWater { get; }` | `SymbolTypeId.FeetOfWater` | ForgeTypeId |
| `ForgeTypeId FeetOfWaterPer100ft { get; }` | `SymbolTypeId.FeetOfWaterPer100ft` | ForgeTypeId |
| `ForgeTypeId FL { get; }` | `SymbolTypeId.FL` | ForgeTypeId |
| `ForgeTypeId FlLowercase { get; }` | `SymbolTypeId.FlLowercase` | ForgeTypeId |
| `ForgeTypeId FootSingleQuote { get; }` | `SymbolTypeId.FootSingleQuote` | ForgeTypeId |
| `ForgeTypeId Fpm { get; }` | `SymbolTypeId.Fpm` | ForgeTypeId |
| `ForgeTypeId Fps { get; }` | `SymbolTypeId.Fps` | ForgeTypeId |
| `ForgeTypeId Ft { get; }` | `SymbolTypeId.Ft` | ForgeTypeId |
| `ForgeTypeId Ftc { get; }` | `SymbolTypeId.Ftc` | ForgeTypeId |
| `ForgeTypeId FtCaret2 { get; }` | `SymbolTypeId.FtCaret2` | ForgeTypeId |
| `ForgeTypeId FtCaret3 { get; }` | `SymbolTypeId.FtCaret3` | ForgeTypeId |
| `ForgeTypeId FtH2O { get; }` | `SymbolTypeId.FtH2O` | ForgeTypeId |
| `ForgeTypeId FtH2OPer100ft { get; }` | `SymbolTypeId.FtH2OPer100ft` | ForgeTypeId |
| `ForgeTypeId FtL { get; }` | `SymbolTypeId.FtL` | ForgeTypeId |
| `ForgeTypeId FtOfWater { get; }` | `SymbolTypeId.FtOfWater` | ForgeTypeId |
| `ForgeTypeId FtOfWaterPer100ft { get; }` | `SymbolTypeId.FtOfWaterPer100ft` | ForgeTypeId |
| `ForgeTypeId FtPerKip { get; }` | `SymbolTypeId.FtPerKip` | ForgeTypeId |
| `ForgeTypeId FtPerMin { get; }` | `SymbolTypeId.FtPerMin` | ForgeTypeId |
| `ForgeTypeId FtPerS { get; }` | `SymbolTypeId.FtPerS` | ForgeTypeId |
| `ForgeTypeId FtPerSSup2 { get; }` | `SymbolTypeId.FtPerSSup2` | ForgeTypeId |
| `ForgeTypeId FtSup2 { get; }` | `SymbolTypeId.FtSup2` | ForgeTypeId |
| `ForgeTypeId FtSup2HPerKbtu { get; }` | `SymbolTypeId.FtSup2HPerKbtu` | ForgeTypeId |
| `ForgeTypeId FtSup2PerFt { get; }` | `SymbolTypeId.FtSup2PerFt` | ForgeTypeId |
| `ForgeTypeId FtSup2PerKip { get; }` | `SymbolTypeId.FtSup2PerKip` | ForgeTypeId |
| `ForgeTypeId FtSup2PerMbh { get; }` | `SymbolTypeId.FtSup2PerMbh` | ForgeTypeId |
| `ForgeTypeId FtSup2PerS { get; }` | `SymbolTypeId.FtSup2PerS` | ForgeTypeId |
| `ForgeTypeId FtSup2PerTon { get; }` | `SymbolTypeId.FtSup2PerTon` | ForgeTypeId |
| `ForgeTypeId FtSup3 { get; }` | `SymbolTypeId.FtSup3` | ForgeTypeId |
| `ForgeTypeId FtSup3HPerMinBtu { get; }` | `SymbolTypeId.FtSup3HPerMinBtu` | ForgeTypeId |
| `ForgeTypeId FtSup3PerH { get; }` | `SymbolTypeId.FtSup3PerH` | ForgeTypeId |
| `ForgeTypeId FtSup3PerKip { get; }` | `SymbolTypeId.FtSup3PerKip` | ForgeTypeId |
| `ForgeTypeId FtSup3PerLbMass { get; }` | `SymbolTypeId.FtSup3PerLbMass` | ForgeTypeId |
| `ForgeTypeId FtSup3PerMin { get; }` | `SymbolTypeId.FtSup3PerMin` | ForgeTypeId |
| `ForgeTypeId FtSup4 { get; }` | `SymbolTypeId.FtSup4` | ForgeTypeId |
| `ForgeTypeId FtSup6 { get; }` | `SymbolTypeId.FtSup6` | ForgeTypeId |
| `ForgeTypeId Gal { get; }` | `SymbolTypeId.Gal` | ForgeTypeId |
| `ForgeTypeId GalPerH { get; }` | `SymbolTypeId.GalPerH` | ForgeTypeId |
| `ForgeTypeId GalPerMin { get; }` | `SymbolTypeId.GalPerMin` | ForgeTypeId |
| `ForgeTypeId GJ { get; }` | `SymbolTypeId.GJ` | ForgeTypeId |
| `ForgeTypeId Gph { get; }` | `SymbolTypeId.Gph` | ForgeTypeId |
| `ForgeTypeId Gpm { get; }` | `SymbolTypeId.Gpm` | ForgeTypeId |
| `ForgeTypeId Grad { get; }` | `SymbolTypeId.Grad` | ForgeTypeId |
| `ForgeTypeId GrPerHFtSup2InHg { get; }` | `SymbolTypeId.GrPerHFtSup2InHg` | ForgeTypeId |
| `ForgeTypeId Hectare { get; }` | `SymbolTypeId.Hectare` | ForgeTypeId |
| `ForgeTypeId HFtSup2DegreeFPerBtu { get; }` | `SymbolTypeId.HFtSup2DegreeFPerBtu` | ForgeTypeId |
| `ForgeTypeId Hour { get; }` | `SymbolTypeId.Hour` | ForgeTypeId |
| `ForgeTypeId Hp { get; }` | `SymbolTypeId.Hp` | ForgeTypeId |
| `ForgeTypeId Hz { get; }` | `SymbolTypeId.Hz` | ForgeTypeId |
| `ForgeTypeId In { get; }` | `SymbolTypeId.In` | ForgeTypeId |
| `ForgeTypeId InCaret2 { get; }` | `SymbolTypeId.InCaret2` | ForgeTypeId |
| `ForgeTypeId InCaret3 { get; }` | `SymbolTypeId.InCaret3` | ForgeTypeId |
| `ForgeTypeId InchDoubleQuote { get; }` | `SymbolTypeId.InchDoubleQuote` | ForgeTypeId |
| `ForgeTypeId InDashWg { get; }` | `SymbolTypeId.InDashWg` | ForgeTypeId |
| `ForgeTypeId InDashWgPer100ft { get; }` | `SymbolTypeId.InDashWgPer100ft` | ForgeTypeId |
| `ForgeTypeId InHg { get; }` | `SymbolTypeId.InHg` | ForgeTypeId |
| `ForgeTypeId InPerSSup2 { get; }` | `SymbolTypeId.InPerSSup2` | ForgeTypeId |
| `ForgeTypeId InSup2 { get; }` | `SymbolTypeId.InSup2` | ForgeTypeId |
| `ForgeTypeId InSup2PerFt { get; }` | `SymbolTypeId.InSup2PerFt` | ForgeTypeId |
| `ForgeTypeId InSup3 { get; }` | `SymbolTypeId.InSup3` | ForgeTypeId |
| `ForgeTypeId InSup4 { get; }` | `SymbolTypeId.InSup4` | ForgeTypeId |
| `ForgeTypeId InSup6 { get; }` | `SymbolTypeId.InSup6` | ForgeTypeId |
| `ForgeTypeId InvDegreeC { get; }` | `SymbolTypeId.InvDegreeC` | ForgeTypeId |
| `ForgeTypeId InvDegreeF { get; }` | `SymbolTypeId.InvDegreeF` | ForgeTypeId |
| `ForgeTypeId InvKip { get; }` | `SymbolTypeId.InvKip` | ForgeTypeId |
| `ForgeTypeId InvKN { get; }` | `SymbolTypeId.InvKN` | ForgeTypeId |
| `ForgeTypeId Joule { get; }` | `SymbolTypeId.Joule` | ForgeTypeId |
| `ForgeTypeId JPerG { get; }` | `SymbolTypeId.JPerG` | ForgeTypeId |
| `ForgeTypeId JPerGDegreeC { get; }` | `SymbolTypeId.JPerGDegreeC` | ForgeTypeId |
| `ForgeTypeId JPerK { get; }` | `SymbolTypeId.JPerK` | ForgeTypeId |
| `ForgeTypeId JPerKgDegreeC { get; }` | `SymbolTypeId.JPerKgDegreeC` | ForgeTypeId |
| `ForgeTypeId JPerMSup2K { get; }` | `SymbolTypeId.JPerMSup2K` | ForgeTypeId |
| `ForgeTypeId KA { get; }` | `SymbolTypeId.KA` | ForgeTypeId |
| `ForgeTypeId Kcal { get; }` | `SymbolTypeId.Kcal` | ForgeTypeId |
| `ForgeTypeId KcalPerS { get; }` | `SymbolTypeId.KcalPerS` | ForgeTypeId |
| `ForgeTypeId Kelvin { get; }` | `SymbolTypeId.Kelvin` | ForgeTypeId |
| `ForgeTypeId KelvinInterval { get; }` | `SymbolTypeId.KelvinInterval` | ForgeTypeId |
| `ForgeTypeId Kg { get; }` | `SymbolTypeId.Kg` | ForgeTypeId |
| `ForgeTypeId Kgf { get; }` | `SymbolTypeId.Kgf` | ForgeTypeId |
| `ForgeTypeId KgfDashM { get; }` | `SymbolTypeId.KgfDashM` | ForgeTypeId |
| `ForgeTypeId KgfDashMPerM { get; }` | `SymbolTypeId.KgfDashMPerM` | ForgeTypeId |
| `ForgeTypeId KgfPerM { get; }` | `SymbolTypeId.KgfPerM` | ForgeTypeId |
| `ForgeTypeId KgfPerMSup2 { get; }` | `SymbolTypeId.KgfPerMSup2` | ForgeTypeId |
| `ForgeTypeId KgPerH { get; }` | `SymbolTypeId.KgPerH` | ForgeTypeId |
| `ForgeTypeId KgPerKgK { get; }` | `SymbolTypeId.KgPerKgK` | ForgeTypeId |
| `ForgeTypeId KgPerM { get; }` | `SymbolTypeId.KgPerM` | ForgeTypeId |
| `ForgeTypeId KgPerMH { get; }` | `SymbolTypeId.KgPerMH` | ForgeTypeId |
| `ForgeTypeId KgPerMin { get; }` | `SymbolTypeId.KgPerMin` | ForgeTypeId |
| `ForgeTypeId KgPerMS { get; }` | `SymbolTypeId.KgPerMS` | ForgeTypeId |
| `ForgeTypeId KgPerMSup2 { get; }` | `SymbolTypeId.KgPerMSup2` | ForgeTypeId |
| `ForgeTypeId KgPerMSup3 { get; }` | `SymbolTypeId.KgPerMSup3` | ForgeTypeId |
| `ForgeTypeId KgPerS { get; }` | `SymbolTypeId.KgPerS` | ForgeTypeId |
| `ForgeTypeId Kip { get; }` | `SymbolTypeId.Kip` | ForgeTypeId |
| `ForgeTypeId KipDashFt { get; }` | `SymbolTypeId.KipDashFt` | ForgeTypeId |
| `ForgeTypeId KipDashFtPerDegree { get; }` | `SymbolTypeId.KipDashFtPerDegree` | ForgeTypeId |
| `ForgeTypeId KipDashFtPerDegreePerFt { get; }` | `SymbolTypeId.KipDashFtPerDegreePerFt` | ForgeTypeId |
| `ForgeTypeId KipDashFtPerFt { get; }` | `SymbolTypeId.KipDashFtPerFt` | ForgeTypeId |
| `ForgeTypeId KipPerFt { get; }` | `SymbolTypeId.KipPerFt` | ForgeTypeId |
| `ForgeTypeId KipPerFtSup2 { get; }` | `SymbolTypeId.KipPerFtSup2` | ForgeTypeId |
| `ForgeTypeId KipPerFtSup3 { get; }` | `SymbolTypeId.KipPerFtSup3` | ForgeTypeId |
| `ForgeTypeId KipPerIn { get; }` | `SymbolTypeId.KipPerIn` | ForgeTypeId |
| `ForgeTypeId KipPerInSup2 { get; }` | `SymbolTypeId.KipPerInSup2` | ForgeTypeId |
| `ForgeTypeId KipPerInSup3 { get; }` | `SymbolTypeId.KipPerInSup3` | ForgeTypeId |
| `ForgeTypeId KJ { get; }` | `SymbolTypeId.KJ` | ForgeTypeId |
| `ForgeTypeId KJPerK { get; }` | `SymbolTypeId.KJPerK` | ForgeTypeId |
| `ForgeTypeId KJPerMSup2K { get; }` | `SymbolTypeId.KJPerMSup2K` | ForgeTypeId |
| `ForgeTypeId KmPerH { get; }` | `SymbolTypeId.KmPerH` | ForgeTypeId |
| `ForgeTypeId KmPerSSup2 { get; }` | `SymbolTypeId.KmPerSSup2` | ForgeTypeId |
| `ForgeTypeId KN { get; }` | `SymbolTypeId.KN` | ForgeTypeId |
| `ForgeTypeId KNDashM { get; }` | `SymbolTypeId.KNDashM` | ForgeTypeId |
| `ForgeTypeId KNDashMPerDegree { get; }` | `SymbolTypeId.KNDashMPerDegree` | ForgeTypeId |
| `ForgeTypeId KNDashMPerDegreePerM { get; }` | `SymbolTypeId.KNDashMPerDegreePerM` | ForgeTypeId |
| `ForgeTypeId KNDashMPerM { get; }` | `SymbolTypeId.KNDashMPerM` | ForgeTypeId |
| `ForgeTypeId KNPerCmSup2 { get; }` | `SymbolTypeId.KNPerCmSup2` | ForgeTypeId |
| `ForgeTypeId KNPerM { get; }` | `SymbolTypeId.KNPerM` | ForgeTypeId |
| `ForgeTypeId KNPerMmSup2 { get; }` | `SymbolTypeId.KNPerMmSup2` | ForgeTypeId |
| `ForgeTypeId KNPerMSup2 { get; }` | `SymbolTypeId.KNPerMSup2` | ForgeTypeId |
| `ForgeTypeId KNPerMSup3 { get; }` | `SymbolTypeId.KNPerMSup3` | ForgeTypeId |
| `ForgeTypeId KPa { get; }` | `SymbolTypeId.KPa` | ForgeTypeId |
| `ForgeTypeId Krone { get; }` | `SymbolTypeId.Krone` | ForgeTypeId |
| `ForgeTypeId Ksf { get; }` | `SymbolTypeId.Ksf` | ForgeTypeId |
| `ForgeTypeId Ksi { get; }` | `SymbolTypeId.Ksi` | ForgeTypeId |
| `ForgeTypeId KV { get; }` | `SymbolTypeId.KV` | ForgeTypeId |
| `ForgeTypeId KVA { get; }` | `SymbolTypeId.KVA` | ForgeTypeId |
| `ForgeTypeId KW { get; }` | `SymbolTypeId.KW` | ForgeTypeId |
| `ForgeTypeId KWh { get; }` | `SymbolTypeId.KWh` | ForgeTypeId |
| `ForgeTypeId Lbf { get; }` | `SymbolTypeId.Lbf` | ForgeTypeId |
| `ForgeTypeId LbfDashFt { get; }` | `SymbolTypeId.LbfDashFt` | ForgeTypeId |
| `ForgeTypeId LbfDashFtPerFt { get; }` | `SymbolTypeId.LbfDashFtPerFt` | ForgeTypeId |
| `ForgeTypeId LbForce { get; }` | `SymbolTypeId.LbForce` | ForgeTypeId |
| `ForgeTypeId LbForceDashFt { get; }` | `SymbolTypeId.LbForceDashFt` | ForgeTypeId |
| `ForgeTypeId LbForceDashFtPerFt { get; }` | `SymbolTypeId.LbForceDashFtPerFt` | ForgeTypeId |
| `ForgeTypeId LbForcePerFt { get; }` | `SymbolTypeId.LbForcePerFt` | ForgeTypeId |
| `ForgeTypeId LbForcePerFtSup2 { get; }` | `SymbolTypeId.LbForcePerFtSup2` | ForgeTypeId |
| `ForgeTypeId LbForcePerFtSup3 { get; }` | `SymbolTypeId.LbForcePerFtSup3` | ForgeTypeId |
| `ForgeTypeId LbForcePerInSup2 { get; }` | `SymbolTypeId.LbForcePerInSup2` | ForgeTypeId |
| `ForgeTypeId LbForceSPerFtSup2 { get; }` | `SymbolTypeId.LbForceSPerFtSup2` | ForgeTypeId |
| `ForgeTypeId LbfPerFt { get; }` | `SymbolTypeId.LbfPerFt` | ForgeTypeId |
| `ForgeTypeId LbfPerFtSup2 { get; }` | `SymbolTypeId.LbfPerFtSup2` | ForgeTypeId |
| `ForgeTypeId LbfPerFtSup3 { get; }` | `SymbolTypeId.LbfPerFtSup3` | ForgeTypeId |
| `ForgeTypeId LbfPerInSup2 { get; }` | `SymbolTypeId.LbfPerInSup2` | ForgeTypeId |
| `ForgeTypeId Lbm { get; }` | `SymbolTypeId.Lbm` | ForgeTypeId |
| `ForgeTypeId LbMass { get; }` | `SymbolTypeId.LbMass` | ForgeTypeId |
| `ForgeTypeId LbMassPerFt { get; }` | `SymbolTypeId.LbMassPerFt` | ForgeTypeId |
| `ForgeTypeId LbMassPerFtDashH { get; }` | `SymbolTypeId.LbMassPerFtDashH` | ForgeTypeId |
| `ForgeTypeId LbMassPerFtDashS { get; }` | `SymbolTypeId.LbMassPerFtDashS` | ForgeTypeId |
| `ForgeTypeId LbMassPerFtSup2 { get; }` | `SymbolTypeId.LbMassPerFtSup2` | ForgeTypeId |
| `ForgeTypeId LbMassPerFtSup3 { get; }` | `SymbolTypeId.LbMassPerFtSup3` | ForgeTypeId |
| `ForgeTypeId LbMassPerH { get; }` | `SymbolTypeId.LbMassPerH` | ForgeTypeId |
| `ForgeTypeId LbMassPerInSup3 { get; }` | `SymbolTypeId.LbMassPerInSup3` | ForgeTypeId |
| `ForgeTypeId LbMassPerLbDegreeF { get; }` | `SymbolTypeId.LbMassPerLbDegreeF` | ForgeTypeId |
| `ForgeTypeId LbMassPerMin { get; }` | `SymbolTypeId.LbMassPerMin` | ForgeTypeId |
| `ForgeTypeId LbMassPerS { get; }` | `SymbolTypeId.LbMassPerS` | ForgeTypeId |
| `ForgeTypeId LbmPerFt { get; }` | `SymbolTypeId.LbmPerFt` | ForgeTypeId |
| `ForgeTypeId LbmPerFtDashH { get; }` | `SymbolTypeId.LbmPerFtDashH` | ForgeTypeId |
| `ForgeTypeId LbmPerFtDashS { get; }` | `SymbolTypeId.LbmPerFtDashS` | ForgeTypeId |
| `ForgeTypeId LbmPerFtSup3 { get; }` | `SymbolTypeId.LbmPerFtSup3` | ForgeTypeId |
| `ForgeTypeId LbmPerInSup3 { get; }` | `SymbolTypeId.LbmPerInSup3` | ForgeTypeId |
| `ForgeTypeId Lf { get; }` | `SymbolTypeId.Lf` | ForgeTypeId |
| `ForgeTypeId Liter { get; }` | `SymbolTypeId.Liter` | ForgeTypeId |
| `ForgeTypeId Lm { get; }` | `SymbolTypeId.Lm` | ForgeTypeId |
| `ForgeTypeId LmPerW { get; }` | `SymbolTypeId.LmPerW` | ForgeTypeId |
| `ForgeTypeId LPerH { get; }` | `SymbolTypeId.LPerH` | ForgeTypeId |
| `ForgeTypeId LPerMin { get; }` | `SymbolTypeId.LPerMin` | ForgeTypeId |
| `ForgeTypeId LPerS { get; }` | `SymbolTypeId.LPerS` | ForgeTypeId |
| `ForgeTypeId LPerSKw { get; }` | `SymbolTypeId.LPerSKw` | ForgeTypeId |
| `ForgeTypeId LPerSMSup2 { get; }` | `SymbolTypeId.LPerSMSup2` | ForgeTypeId |
| `ForgeTypeId LPerSMSup3 { get; }` | `SymbolTypeId.LPerSMSup3` | ForgeTypeId |
| `ForgeTypeId Lpm { get; }` | `SymbolTypeId.Lpm` | ForgeTypeId |
| `ForgeTypeId Lps { get; }` | `SymbolTypeId.Lps` | ForgeTypeId |
| `ForgeTypeId LpsPerMSup2 { get; }` | `SymbolTypeId.LpsPerMSup2` | ForgeTypeId |
| `ForgeTypeId Lx { get; }` | `SymbolTypeId.Lx` | ForgeTypeId |
| `ForgeTypeId MA { get; }` | `SymbolTypeId.MA` | ForgeTypeId |
| `ForgeTypeId Mbh { get; }` | `SymbolTypeId.Mbh` | ForgeTypeId |
| `ForgeTypeId MCaret2 { get; }` | `SymbolTypeId.MCaret2` | ForgeTypeId |
| `ForgeTypeId MCaret3 { get; }` | `SymbolTypeId.MCaret3` | ForgeTypeId |
| `ForgeTypeId Meter { get; }` | `SymbolTypeId.Meter` | ForgeTypeId |
| `ForgeTypeId MH2O { get; }` | `SymbolTypeId.MH2O` | ForgeTypeId |
| `ForgeTypeId MH2OPerM { get; }` | `SymbolTypeId.MH2OPerM` | ForgeTypeId |
| `ForgeTypeId Min { get; }` | `SymbolTypeId.Min` | ForgeTypeId |
| `ForgeTypeId MiPerSSup2 { get; }` | `SymbolTypeId.MiPerSSup2` | ForgeTypeId |
| `ForgeTypeId MJ { get; }` | `SymbolTypeId.MJ` | ForgeTypeId |
| `ForgeTypeId Mm { get; }` | `SymbolTypeId.Mm` | ForgeTypeId |
| `ForgeTypeId MmCaret2 { get; }` | `SymbolTypeId.MmCaret2` | ForgeTypeId |
| `ForgeTypeId MmCaret3 { get; }` | `SymbolTypeId.MmCaret3` | ForgeTypeId |
| `ForgeTypeId MmH2O { get; }` | `SymbolTypeId.MmH2O` | ForgeTypeId |
| `ForgeTypeId MmH2OPerM { get; }` | `SymbolTypeId.MmH2OPerM` | ForgeTypeId |
| `ForgeTypeId MmHg { get; }` | `SymbolTypeId.MmHg` | ForgeTypeId |
| `ForgeTypeId MmSup2 { get; }` | `SymbolTypeId.MmSup2` | ForgeTypeId |
| `ForgeTypeId MmSup2PerM { get; }` | `SymbolTypeId.MmSup2PerM` | ForgeTypeId |
| `ForgeTypeId MmSup3 { get; }` | `SymbolTypeId.MmSup3` | ForgeTypeId |
| `ForgeTypeId MmSup4 { get; }` | `SymbolTypeId.MmSup4` | ForgeTypeId |
| `ForgeTypeId MmSup6 { get; }` | `SymbolTypeId.MmSup6` | ForgeTypeId |
| `ForgeTypeId MN { get; }` | `SymbolTypeId.MN` | ForgeTypeId |
| `ForgeTypeId MNDashM { get; }` | `SymbolTypeId.MNDashM` | ForgeTypeId |
| `ForgeTypeId MNDashMPerM { get; }` | `SymbolTypeId.MNDashMPerM` | ForgeTypeId |
| `ForgeTypeId MNPerM { get; }` | `SymbolTypeId.MNPerM` | ForgeTypeId |
| `ForgeTypeId MNPerMSup2 { get; }` | `SymbolTypeId.MNPerMSup2` | ForgeTypeId |
| `ForgeTypeId MPa { get; }` | `SymbolTypeId.MPa` | ForgeTypeId |
| `ForgeTypeId MPerKN { get; }` | `SymbolTypeId.MPerKN` | ForgeTypeId |
| `ForgeTypeId MPerS { get; }` | `SymbolTypeId.MPerS` | ForgeTypeId |
| `ForgeTypeId MPerSSup2 { get; }` | `SymbolTypeId.MPerSSup2` | ForgeTypeId |
| `ForgeTypeId Mph { get; }` | `SymbolTypeId.Mph` | ForgeTypeId |
| `ForgeTypeId Ms { get; }` | `SymbolTypeId.Ms` | ForgeTypeId |
| `ForgeTypeId MSup2 { get; }` | `SymbolTypeId.MSup2` | ForgeTypeId |
| `ForgeTypeId MSup2KPerW { get; }` | `SymbolTypeId.MSup2KPerW` | ForgeTypeId |
| `ForgeTypeId MSup2PerKN { get; }` | `SymbolTypeId.MSup2PerKN` | ForgeTypeId |
| `ForgeTypeId MSup2PerKw { get; }` | `SymbolTypeId.MSup2PerKw` | ForgeTypeId |
| `ForgeTypeId MSup2PerM { get; }` | `SymbolTypeId.MSup2PerM` | ForgeTypeId |
| `ForgeTypeId MSup2PerS { get; }` | `SymbolTypeId.MSup2PerS` | ForgeTypeId |
| `ForgeTypeId MSup3 { get; }` | `SymbolTypeId.MSup3` | ForgeTypeId |
| `ForgeTypeId MSup3PerH { get; }` | `SymbolTypeId.MSup3PerH` | ForgeTypeId |
| `ForgeTypeId MSup3PerHMSup2 { get; }` | `SymbolTypeId.MSup3PerHMSup2` | ForgeTypeId |
| `ForgeTypeId MSup3PerHMSup3 { get; }` | `SymbolTypeId.MSup3PerHMSup3` | ForgeTypeId |
| `ForgeTypeId MSup3PerKg { get; }` | `SymbolTypeId.MSup3PerKg` | ForgeTypeId |
| `ForgeTypeId MSup3PerKN { get; }` | `SymbolTypeId.MSup3PerKN` | ForgeTypeId |
| `ForgeTypeId MSup3PerS { get; }` | `SymbolTypeId.MSup3PerS` | ForgeTypeId |
| `ForgeTypeId MSup3PerWS { get; }` | `SymbolTypeId.MSup3PerWS` | ForgeTypeId |
| `ForgeTypeId MSup4 { get; }` | `SymbolTypeId.MSup4` | ForgeTypeId |
| `ForgeTypeId MSup6 { get; }` | `SymbolTypeId.MSup6` | ForgeTypeId |
| `ForgeTypeId MV { get; }` | `SymbolTypeId.MV` | ForgeTypeId |
| `ForgeTypeId MW { get; }` | `SymbolTypeId.MW` | ForgeTypeId |
| `ForgeTypeId NDashM { get; }` | `SymbolTypeId.NDashM` | ForgeTypeId |
| `ForgeTypeId NDashMPerM { get; }` | `SymbolTypeId.NDashMPerM` | ForgeTypeId |
| `ForgeTypeId Newton { get; }` | `SymbolTypeId.Newton` | ForgeTypeId |
| `ForgeTypeId NgPerPaSMSup2 { get; }` | `SymbolTypeId.NgPerPaSMSup2` | ForgeTypeId |
| `ForgeTypeId NPerM { get; }` | `SymbolTypeId.NPerM` | ForgeTypeId |
| `ForgeTypeId NPerMmSup2 { get; }` | `SymbolTypeId.NPerMmSup2` | ForgeTypeId |
| `ForgeTypeId NPerMSup2 { get; }` | `SymbolTypeId.NPerMSup2` | ForgeTypeId |
| `ForgeTypeId NSPerMSup2 { get; }` | `SymbolTypeId.NSPerMSup2` | ForgeTypeId |
| `ForgeTypeId OhmM { get; }` | `SymbolTypeId.OhmM` | ForgeTypeId |
| `ForgeTypeId OneColon { get; }` | `SymbolTypeId.OneColon` | ForgeTypeId |
| `ForgeTypeId Pa { get; }` | `SymbolTypeId.Pa` | ForgeTypeId |
| `ForgeTypeId PaDashS { get; }` | `SymbolTypeId.PaDashS` | ForgeTypeId |
| `ForgeTypeId PaPerM { get; }` | `SymbolTypeId.PaPerM` | ForgeTypeId |
| `ForgeTypeId Percent { get; }` | `SymbolTypeId.Percent` | ForgeTypeId |
| `ForgeTypeId PerMille { get; }` | `SymbolTypeId.PerMille` | ForgeTypeId |
| `ForgeTypeId Pi { get; }` | `SymbolTypeId.Pi` | ForgeTypeId |
| `ForgeTypeId Psf { get; }` | `SymbolTypeId.Psf` | ForgeTypeId |
| `ForgeTypeId Psi { get; }` | `SymbolTypeId.Psi` | ForgeTypeId |
| `ForgeTypeId Psia { get; }` | `SymbolTypeId.Psia` | ForgeTypeId |
| `ForgeTypeId Psig { get; }` | `SymbolTypeId.Psig` | ForgeTypeId |
| `ForgeTypeId Rad { get; }` | `SymbolTypeId.Rad` | ForgeTypeId |
| `ForgeTypeId RadPerS { get; }` | `SymbolTypeId.RadPerS` | ForgeTypeId |
| `ForgeTypeId Rpm { get; }` | `SymbolTypeId.Rpm` | ForgeTypeId |
| `ForgeTypeId Rps { get; }` | `SymbolTypeId.Rps` | ForgeTypeId |
| `ForgeTypeId Second { get; }` | `SymbolTypeId.Second` | ForgeTypeId |
| `ForgeTypeId Sf { get; }` | `SymbolTypeId.Sf` | ForgeTypeId |
| `ForgeTypeId SfHPerKbtu { get; }` | `SymbolTypeId.SfHPerKbtu` | ForgeTypeId |
| `ForgeTypeId SfPerMbh { get; }` | `SymbolTypeId.SfPerMbh` | ForgeTypeId |
| `ForgeTypeId SfPerTon { get; }` | `SymbolTypeId.SfPerTon` | ForgeTypeId |
| `ForgeTypeId Shaku { get; }` | `SymbolTypeId.Shaku` | ForgeTypeId |
| `ForgeTypeId Shekel { get; }` | `SymbolTypeId.Shekel` | ForgeTypeId |
| `ForgeTypeId SlopeDegree { get; }` | `SymbolTypeId.SlopeDegree` | ForgeTypeId |
| `ForgeTypeId Stf { get; }` | `SymbolTypeId.Stf` | ForgeTypeId |
| `ForgeTypeId Tf { get; }` | `SymbolTypeId.Tf` | ForgeTypeId |
| `ForgeTypeId TfDashM { get; }` | `SymbolTypeId.TfDashM` | ForgeTypeId |
| `ForgeTypeId TfDashMPerM { get; }` | `SymbolTypeId.TfDashMPerM` | ForgeTypeId |
| `ForgeTypeId TfPerM { get; }` | `SymbolTypeId.TfPerM` | ForgeTypeId |
| `ForgeTypeId TfPerMSup2 { get; }` | `SymbolTypeId.TfPerMSup2` | ForgeTypeId |
| `ForgeTypeId Therm { get; }` | `SymbolTypeId.Therm` | ForgeTypeId |
| `ForgeTypeId Ton { get; }` | `SymbolTypeId.Ton` | ForgeTypeId |
| `ForgeTypeId Tonne { get; }` | `SymbolTypeId.Tonne` | ForgeTypeId |
| `ForgeTypeId TonOfRefrigeration { get; }` | `SymbolTypeId.TonOfRefrigeration` | ForgeTypeId |
| `ForgeTypeId Tonsf { get; }` | `SymbolTypeId.Tonsf` | ForgeTypeId |
| `ForgeTypeId UinPerInDegreeF { get; }` | `SymbolTypeId.UinPerInDegreeF` | ForgeTypeId |
| `ForgeTypeId UkPound { get; }` | `SymbolTypeId.UkPound` | ForgeTypeId |
| `ForgeTypeId UmPerMDegreeC { get; }` | `SymbolTypeId.UmPerMDegreeC` | ForgeTypeId |
| `ForgeTypeId UsDollar { get; }` | `SymbolTypeId.UsDollar` | ForgeTypeId |
| `ForgeTypeId Usft { get; }` | `SymbolTypeId.Usft` | ForgeTypeId |
| `ForgeTypeId Usgph { get; }` | `SymbolTypeId.Usgph` | ForgeTypeId |
| `ForgeTypeId Usgpm { get; }` | `SymbolTypeId.Usgpm` | ForgeTypeId |
| `ForgeTypeId UsTonnesForceSt { get; }` | `SymbolTypeId.UsTonnesForceSt` | ForgeTypeId |
| `ForgeTypeId UsTonnesForceT { get; }` | `SymbolTypeId.UsTonnesForceT` | ForgeTypeId |
| `ForgeTypeId UsTonnesForceTons { get; }` | `SymbolTypeId.UsTonnesForceTons` | ForgeTypeId |
| `ForgeTypeId UsTonnesMassSt { get; }` | `SymbolTypeId.UsTonnesMassSt` | ForgeTypeId |
| `ForgeTypeId UsTonnesMassT { get; }` | `SymbolTypeId.UsTonnesMassT` | ForgeTypeId |
| `ForgeTypeId UsTonnesMassTons { get; }` | `SymbolTypeId.UsTonnesMassTons` | ForgeTypeId |
| `ForgeTypeId VA { get; }` | `SymbolTypeId.VA` | ForgeTypeId |
| `ForgeTypeId VAPerFtSup2 { get; }` | `SymbolTypeId.VAPerFtSup2` | ForgeTypeId |
| `ForgeTypeId VAPerMSup2 { get; }` | `SymbolTypeId.VAPerMSup2` | ForgeTypeId |
| `ForgeTypeId Volt { get; }` | `SymbolTypeId.Volt` | ForgeTypeId |
| `ForgeTypeId Watt { get; }` | `SymbolTypeId.Watt` | ForgeTypeId |
| `ForgeTypeId WMinPerFtSup3 { get; }` | `SymbolTypeId.WMinPerFtSup3` | ForgeTypeId |
| `ForgeTypeId Won { get; }` | `SymbolTypeId.Won` | ForgeTypeId |
| `ForgeTypeId WPerFt { get; }` | `SymbolTypeId.WPerFt` | ForgeTypeId |
| `ForgeTypeId WPerFtSup2 { get; }` | `SymbolTypeId.WPerFtSup2` | ForgeTypeId |
| `ForgeTypeId WPerFtSup3 { get; }` | `SymbolTypeId.WPerFtSup3` | ForgeTypeId |
| `ForgeTypeId WPerM { get; }` | `SymbolTypeId.WPerM` | ForgeTypeId |
| `ForgeTypeId WPerMK { get; }` | `SymbolTypeId.WPerMK` | ForgeTypeId |
| `ForgeTypeId WPerMSup2 { get; }` | `SymbolTypeId.WPerMSup2` | ForgeTypeId |
| `ForgeTypeId WPerMSup2K { get; }` | `SymbolTypeId.WPerMSup2K` | ForgeTypeId |
| `ForgeTypeId WPerMSup3 { get; }` | `SymbolTypeId.WPerMSup3` | ForgeTypeId |
| `ForgeTypeId WSPerMSup3 { get; }` | `SymbolTypeId.WSPerMSup3` | ForgeTypeId |
| `ForgeTypeId YdCaret3 { get; }` | `SymbolTypeId.YdCaret3` | ForgeTypeId |
| `ForgeTypeId YdSup3 { get; }` | `SymbolTypeId.YdSup3` | ForgeTypeId |
| `ForgeTypeId Yen { get; }` | `SymbolTypeId.Yen` | ForgeTypeId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```